/*
 Navicat Premium Data Transfer

 Source Server         : localhost
 Source Server Type    : MySQL
 Source Server Version : 50721
 Source Host           : localhost
 Source Database       : accounts

 Target Server Type    : MySQL
 Target Server Version : 50721
 File Encoding         : utf-8

 Date: 03/23/2018 14:39:13 PM
*/

SET NAMES utf8;
SET FOREIGN_KEY_CHECKS = 0;

-- ----------------------------
--  Table structure for `accounts`
-- ----------------------------
DROP TABLE IF EXISTS `accounts`;
CREATE TABLE `accounts` (
  `phone` varchar(11) NOT NULL COMMENT '手机号',
  `pass` varchar(20) NOT NULL DEFAULT '123456' COMMENT '密码，默认是123456',
  `status` int(11) NOT NULL DEFAULT '1' COMMENT '1为正常  0为不正常',
  `lastBuy` varchar(255) DEFAULT NULL COMMENT '最后一次购买时间',
  `lastPoint` varchar(255) DEFAULT NULL COMMENT '最后一次预约时间',
  `remark` varchar(255) DEFAULT NULL COMMENT '标注',
  `address` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`phone`),
  UNIQUE KEY `phone_UNIQUE` (`phone`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- ----------------------------
--  Records of `accounts`
-- ----------------------------
BEGIN;
INSERT INTO `accounts` VALUES ('13102661153', '123456', '1', null, null, '雍贵中心', null), ('13153185002', '123456', '1', null, null, '雍贵中心', null), ('13157440883', '123456', '1', null, null, '雍贵中心', null), ('13176048776', '123456', '1', null, null, '汽车大厦双龙', null), ('13191162477', 'a123456', '1', null, null, null, null), ('13229062911', '123123', '0', null, null, '汽车大厦双龙', null), ('13269747667', '123456', '0', null, null, '雍贵中心', null), ('13336323159', '4063443 ', '1', null, null, '汽车大厦双龙', null), ('13343192376', '123456', '1', null, null, '雍贵中心', null), ('13351208936', 'jss19860529', '1', null, null, '汽车大厦双龙', null), ('13392151517', '123456', '1', null, null, '雍贵中心', null), ('13399381732', 'q123456', '1', null, null, '汽车大厦双龙', null), ('13413723166', '123456', '1', null, null, '雍贵中心', null), ('13453301621', '654321', '1', null, null, '汽车大厦双龙', null), ('13485665212', '123456', '1', null, null, '雍贵中心', null), ('13512856201', 'wyp100721', '1', null, null, '雍贵中心', null), ('13519083633', 'q123456', '1', null, null, '汽车大厦双龙', null), ('13521690981', '123456', '1', null, null, '汽车大厦双龙', null), ('13526139009', 'DONG490099', '1', null, null, '汽车大厦双龙', null), ('13546886639', 'qin141208', '1', null, null, '汽车大厦双龙', null), ('13567593632', '123456', '1', null, null, '汽车大厦双龙', null), ('13624666057', 'a123456', '1', null, null, null, null), ('13633696711', 'w070416', '1', null, null, '汽车大厦双龙', null), ('13670589613', 'a123456', '1', null, null, null, null), ('13700077519', '123456', '1', null, null, '雍贵中心', null), ('13764763451', '123456', '1', null, null, '雍贵中心', null), ('13792080758', 'a123456', '1', null, null, null, null), ('13905853361', '123456', '1', null, null, '汽车大厦双龙', null), ('13907971151', 'w011765', '0', null, null, '雍贵中心', null), ('13938038163', '123456', '1', null, null, '汽车大厦双龙', null), ('13993852417', 'q123456', '1', null, null, '汽车大厦双龙', null), ('15022156584', '123456', '1', null, null, '雍贵中心', null), ('15039586436', '123456', '1', null, null, '汽车大厦双龙', null), ('15046846298', 'a123456', '1', null, null, null, null), ('15063527328', '123456', '1', null, null, '雍贵中心', null), ('15075870950', '123456', '1', null, null, '雍贵中心', null), ('15102549597', 'ml080727', '1', null, null, '汽车大厦双龙', null), ('15131828567', '123456', '1', null, null, '汽车大厦双龙', null), ('15203534014', '654321', '1', null, null, '汽车大厦双龙', null), ('15206334886', '123456', '1', null, null, '雍贵中心', null), ('15249625137', 'a123456', '1', null, null, null, null), ('15264711001', '123456', '1', null, null, '汽车大厦双龙', null), ('15264711296', '123456', '1', null, null, '汽车大厦双龙', null), ('15303199414', '123456', '1', null, null, '雍贵中心', null), ('15354193781', '123456', '1', null, null, '雍贵中心', null), ('15373204143', '123456', '1', null, null, '雍贵中心', null), ('15393630594', '123456', '1', null, null, '汽车大厦双龙', null), ('15399130078', '125018adg', '1', null, null, '雍贵中心', null), ('15515970953', '123456', '1', null, null, '雍贵中心', null), ('15518849009', 'DONG490099', '1', null, null, '汽车大厦双龙', null), ('15549208672', '123456', '1', null, null, '雍贵中心', null), ('15610959065', '123456', '0', null, null, '雍贵中心', null), ('15613794675', 'a123456', '1', null, null, null, null), ('15627944858', '123456', '1', null, null, '雍贵中心', null), ('15633523066', 'abc123', '1', null, null, '汽车大厦双龙', null), ('15645919316', '123456', '1', null, null, '雍贵中心', null), ('15697680921', '123456', '1', null, null, '雍贵中心', null), ('15698229041', '123456', '1', null, null, '雍贵中心', null), ('15699770933', '123456', '1', null, null, '汽车大厦双龙', null), ('15777186432', '15177909309', '1', null, null, '汽车大厦双龙', null), ('15896171467', '123456', '0', null, null, '汽车大厦双龙', null), ('15935492346', 'a123456', '1', null, null, null, null), ('15937230461', '123456', '1', null, null, '雍贵中心', null), ('15949806339', 'lhj0325', '1', null, null, '汽车大厦双龙', null), ('15951853170', '123456', '1', null, null, '雍贵中心', null), ('15981953127', '123456', '1', null, null, '雍贵中心', null), ('15984049899', '690928', '0', null, null, '汽车大厦双龙', null), ('17097224268', '123456', '1', null, null, '雍贵中心', null), ('17335351190', '123456', '1', null, null, '雍贵中心', null), ('17379324087', '123456', '1', null, null, '雍贵中心', null), ('17393819912', 'q123456', '0', null, null, '汽车大厦双龙', null), ('17505106529', '132623', '1', null, null, '汽车大厦双龙', null), ('17535275750', '123456', '1', null, null, '雍贵中心', null), ('17612746321', '123456321654', '1', null, null, '汽车大厦双龙', null), ('17753747930', '8642569', '1', null, null, '汽车大厦双龙', null), ('17757449525', '123456', '1', null, null, '雍贵中心', null), ('18032952504', '123456', '1', null, null, '雍贵中心', null), ('18131970041', '123456', '1', null, null, '雍贵中心', null), ('18201603185', '123456', '1', null, null, '雍贵中心', null), ('18207517996', '123456', '1', null, null, '雍贵中心', null), ('18232902912', '108108li', '1', null, null, '雍贵中心', null), ('18246626742', 'jss19860529', '1', null, null, '汽车大厦双龙', null), ('18253251389', '123456', '1', null, null, '雍贵中心', null), ('18312784029', '123456', '0', null, null, '雍贵中心', null), ('18333966217', '123456', '1', null, null, '雍贵中心', null), ('18353874500', 'anjiaqi112828', '1', null, null, '汽车大厦双龙', null), ('18382394514', '123456', '1', null, null, '雍贵中心', null), ('18537303412', 'z410781', '1', null, null, '汽车大厦双龙', null), ('18629896680', '123456', '1', null, null, '雍贵中心', null), ('18709222182', '123456', '1', null, null, '雍贵中心', null), ('18722494087', '123456', '1', null, null, '雍贵中心', null), ('18810320392', '12345678', '1', null, null, '雍贵中心', null), ('18834168128', 'A3396815', '1', null, null, '汽车大厦双龙', null), ('18863572962', '123456', '1', null, null, '雍贵中心', null), ('18903188059', 'a123456', '1', null, null, null, null), ('18946959184', '123456', '1', null, null, '雍贵中心', null), ('18967839427', '123456', '1', null, null, '雍贵中心', null), ('18982761259', '721025', '1', null, null, '汽车大厦双龙', null), ('19909021857', 'jyx741118', '0', null, null, '雍贵中心', null);
COMMIT;

-- ----------------------------
--  Table structure for `address`
-- ----------------------------
DROP TABLE IF EXISTS `address`;
CREATE TABLE `address` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `address` varchar(255) DEFAULT NULL,
  `lat` float(255,6) DEFAULT NULL,
  `lng` float(255,6) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=151 DEFAULT CHARSET=utf8;

-- ----------------------------
--  Records of `address`
-- ----------------------------
BEGIN;
INSERT INTO `address` VALUES ('131', '北京市丰台区黄陈路益智发商城东(期颐百年东)', '116.346642', '39.812122'), ('132', '期颐百年24', '116.346527', '39.812981'), ('133', '京良公路', '116.346954', '39.813412'), ('134', '西红门九龙口休闲公园(南四环京开路与京良路交叉口)', '116.350182', '39.812088'), ('135', '北京市丰台区', '116.351898', '39.814568'), ('136', '北京市大兴区西红门黄陈路九龙假日俱乐部', '116.350677', '39.811417'), ('137', '北京市丰台区京良路8号', '116.344757', '39.809372'), ('138', '新发地村期颐百年小区乙9号楼', '116.343811', '39.815113'), ('139', '北京市大兴区西红门九龙山庄耀艳大厦306', '116.351830', '39.809406'), ('140', '北京市丰台区期颐百年10号楼', '116.343483', '39.814102'), ('141', '北京市丰台区黄陈路益智发商城东(期颐百年东)', '116.346642', '39.812122'), ('142', '期颐百年24', '116.346527', '39.812981'), ('143', '京良公路', '116.346954', '39.813412'), ('144', '西红门九龙口休闲公园(南四环京开路与京良路交叉口)', '116.350182', '39.812088'), ('145', '北京市丰台区', '116.351898', '39.814568'), ('146', '北京市大兴区西红门黄陈路九龙假日俱乐部', '116.350677', '39.811417'), ('147', '北京市丰台区京良路8号', '116.344757', '39.809372'), ('148', '新发地村期颐百年小区乙9号楼', '116.343811', '39.815113'), ('149', '北京市大兴区西红门九龙山庄耀艳大厦306', '116.351830', '39.809406'), ('150', '北京市丰台区期颐百年10号楼', '116.343483', '39.814102');
COMMIT;

SET FOREIGN_KEY_CHECKS = 1;
